Can't Finish Group while in Sketch Mode.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotFinishGroupInSketchMode { get; }
  Visual Basic
Public Shared ReadOnly Property CannotFinishGroupInSketchMode As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotFinishGroupInSketchMode {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GroupFailures Class
  Autodesk.Revit.DB Namespace